{
  "id": "https://thecryptobasic.com/?p=127872",
  "title": "Analyst Reveals His XRP Sell Targets, Says These Levels Could Upset a Lot of Maxis",
  "link": "https://thecryptobasic.com/2025/06/09/analyst-reveals-his-xrp-sell-targets-says-these-levels-could-upset-a-lot-of-maxis/?utm_source=rss&utm_medium=rss&utm_campaign=analyst-reveals-his-xrp-sell-targets-says-these-levels-could-upset-a-lot-of-maxis",
  "summary": "<strong>Mr. Xoom, a prominent XRP analyst, has presented his bullish sell targets, but suggests they might not sit well with some proponents.</strong>\n\nAccording to the analyst, this is because most of these proponents may find their targets too conservative. For context, with investors anticipating an XRP breakout since the asset's collapse in January 2018, this seven-year wait has triggered <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/05/03/i-bought-xrp-at-0-10-to-cash-out-a",
  "published": "Mon, 09 Jun 2025 13:59:12 +0000",
  "content": "<strong>Mr. Xoom, a prominent XRP analyst, has presented his bullish sell targets, but suggests they might not sit well with some proponents.</strong>\n\nAccording to the analyst, this is because most of these proponents may find their targets too conservative. For context, with investors anticipating an XRP breakout since the asset's collapse in January 2018, this seven-year wait has triggered <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/05/03/i-bought-xrp-at-0-10-to-cash-out-at-100-not-to-be-shaken-out-at-2-expert-says/\" rel=\"noopener\" target=\"_blank\">an appetite for greater returns</a>.\nMr. Xoom Reveals His XRP Take-Profit Targets\nHowever, Mr. Xoom is looking to take profit on his XRP bag at lower targets. In his latest <a class=\"editor-rtfLink\" href=\"https://x.com/Mr_Xoom/status/1931451235150008655\" rel=\"nofollow noopener\" target=\"_blank\">commentary</a>, he first disclosed that he sold 15% of his XRP holdings when the asset claimed $2.8. Notably, XRP has hit $2.8 four times this bull run. This occurred in December 2024, January 2025, February 2025, and March 2025.\n\nWhile Mr. Xoom failed to highlight the exact moment, he also confirmed that he re-bought XRP when the asset dropped to $2. An investor questioned the practicality of such a move, considering tax implications. However, Xoom <a class=\"editor-rtfLink\" href=\"https://x.com/Mr_Xoom/status/1931513969769898398\" rel=\"noopener\" target=\"_blank\">stressed</a> that he does not pay taxes, being a Dubai resident.\n\nNow, the market analyst plans to sell another 15% of his holdings once XRP claims the $4.5 to $5 region. This level would mark a 102% to 124% increase from XRP's current price of $2.23. Interestingly, trader Crypto Beast also <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/06/07/holding-1-8m-xrp-to-turn-into-10m-heres-how/\" rel=\"noopener\" target=\"_blank\">plans to take profit</a> of around $5, when his XRP investment grows to $10 million. \n\nMeanwhile, after selling 15% of his XRP investment at $4.5 to $5, Mr. Xoom revealed he would hold onto the rest of the bag until XRP claims the $7 to $8 price area, representing a 214% to 259% rise from current levels. The analyst had <a class=\"editor-rtfLink\" href=\"https://x.com/Mr_Xoom/status/1885471935351431171\" rel=\"noopener\" target=\"_blank\">confirmed this</a> in a February disclosure in which he lined up his TP targets on different assets.\n\nHowever, despite planning to take profit at $8, Mr. Xoom believes XRP could reach greater heights. According to him, his XRP upside target is actually $8 to $13. Nonetheless, he is taking profit at lower regions as it is ill-advised to try to time the top, a move that could lead to one being caught up in a sudden retracement.\nXRP's Direction from Here\nNotably, the recent disclosure came on the back of an analysis from the market watcher, in which he suggested that XRP could move in two ways from its level at the time. During his analysis, <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/tag/ripple/\" rel=\"noopener\" target=\"_blank\">XRP</a> traded for $2.17, changing hands at a delicate position just above $2.\n\nMr. Xoom suggested that from that level, the asset could first drop further toward the $1.9 to $2 zone to grab further liquidity due to the buy orders in this area. After grabbing liquidity, XRP would then proceed with a recovery push.\n\nhttps://twitter.com/Mr_Xoom/status/1931434965352554547\n\nHowever, according to Xoom, if the asset does not take this route, it could consolidate at the level above $2 for some time before embarking on an upward push. Mr. Xoom leaned toward this scenario, and it appears it is now playing out. \n\nCurrently trading for $2.44, XRP is up 4.3% in the past week, making it the second-largest gainer among the top 10 in this timeframe, only behind Tron (TRX), which is up 4.9% in the same period.",
  "title_pt": "Analista revela seus alvos de venda de XRP: estes níveis podem irritar muitos maximalistas",
  "summary_pt": "O analista de XRP, Mr. Xoom, apresentou suas metas de venda otimistas (bullish), mas sugere que elas podem não agradar a alguns entusiastas.\n\nDe acordo com o analista, isso se deve ao fato de que a maioria desses entusiastas pode considerar suas metas muito conservadoras.  Para contextualizar, com investidores antecipando uma alta (breakout) do XRP desde a queda do ativo em janeiro de 2018, esta espera de sete anos desencadeou... (a continuação do link foi omitida, pois não faz parte do texto original fornecido).",
  "content_pt": "O analista de XRP, Sr. Xoom, divulgou suas metas de venda otimistas, mas sugere que elas podem não agradar a alguns entusiastas.\n\nDe acordo com o analista, isso se deve ao fato de que a maioria desses entusiastas pode considerar suas metas muito conservadoras.  Para contextualizar, com investidores antecipando uma alta do XRP desde a queda do ativo em janeiro de 2018, essa espera de sete anos gerou um apetite por retornos maiores.\n\n**Sr. Xoom Revela Suas Metas de Lucro para XRP**\n\nNo entanto, o Sr. Xoom pretende lucrar com sua posição em XRP em metas mais baixas. Em seu último comentário, ele revelou ter vendido 15% de suas holdings de XRP quando o ativo atingiu US$ 2,8.  É importante notar que o XRP atingiu US$ 2,8 quatro vezes neste ciclo de alta: em dezembro de 2024, janeiro de 2025, fevereiro de 2025 e março de 2025.\n\nEmbora o Sr. Xoom não tenha especificado o momento exato, ele também confirmou que recomprou XRP quando o ativo caiu para US$ 2. Um investidor questionou a viabilidade dessa ação, considerando as implicações tributárias. No entanto, Xoom enfatizou que ele não paga impostos, por ser residente de Dubai.\n\nAgora, o analista de mercado planeja vender outros 15% de suas holdings quando o XRP atingir a faixa de US$ 4,5 a US$ 5. Esse nível representaria um aumento de 102% a 124% em relação ao preço atual do XRP de US$ 2,23. Curiosamente, o trader Crypto Beast também planeja obter lucro por volta de US$ 5, quando seu investimento em XRP atingir US$ 10 milhões.\n\nEnquanto isso, após vender 15% de seu investimento em XRP entre US$ 4,5 e US$ 5, o Sr. Xoom revelou que manteria o restante de sua posição até que o XRP atingisse a faixa de preço de US$ 7 a US$ 8, representando um aumento de 214% a 259% em relação aos níveis atuais. O analista havia confirmado isso em uma divulgação em fevereiro, na qual ele listou suas metas de *take-profit* em diferentes ativos.\n\nNo entanto, apesar de planejar lucrar a US$ 8, o Sr. Xoom acredita que o XRP pode atingir patamares ainda maiores. Segundo ele, sua meta de alta para o XRP é, na verdade, de US$ 8 a US$ 13.  Apesar disso, ele está lucrando em regiões mais baixas, pois é imprudente tentar prever o pico, uma ação que pode levar a ser pego em uma retração repentina.\n\n**A Direção do XRP a Partir Daqui**\n\nÉ importante destacar que a recente divulgação ocorreu após uma análise do observador de mercado, na qual ele sugeriu que o XRP poderia se mover de duas maneiras a partir de seu nível na época. Durante sua análise, o XRP era negociado a US$ 2,17, em uma posição delicada, pouco acima de US$ 2.\n\nO Sr. Xoom sugeriu que, a partir desse nível, o ativo poderia primeiro cair para a zona de US$ 1,9 a US$ 2 para buscar mais liquidez devido às ordens de compra nessa área. Após obter liquidez, o XRP prosseguiria com uma recuperação.\n\nhttps://twitter.com/Mr_Xoom/status/1931434965352554547\n\nNo entanto, de acordo com Xoom, se o ativo não seguir esse caminho, ele poderia se consolidar acima de US$ 2 por algum tempo antes de iniciar uma alta. O Sr. Xoom se inclinou para esse cenário, e parece que ele está se concretizando.\n\nAtualmente negociado a US$ 2,44, o XRP subiu 4,3% na última semana, sendo o segundo maior ganho entre os 10 principais nesse período, atrás apenas da Tron (TRX), que subiu 4,9% no mesmo período.",
  "filename": "post_1749510099_analista-revela-seus-alvos-de-venda-de-xrp-estes-niveis-podem-irritar-muitos-max.json"
}