{
  "id": "https://thecryptobasic.com/?p=127915",
  "title": "Chainlink Powers Cross-Border CBDC-Stablecoin Pilot Between Hong Kong and Australia",
  "link": "https://thecryptobasic.com/2025/06/09/chainlink-powers-cross-border-cbdc-stablecoin-pilot-between-hong-kong-and-australia/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-powers-cross-border-cbdc-stablecoin-pilot-between-hong-kong-and-australia",
  "summary": "<strong>Chainlink (LINK) played a pivotal role in a successful pilot program that facilitated the exchange of two central bank digital currencies (CBDCs).</strong>\n\nThe pilot involved the Hong Kong digital dollar (e-HKD) and an Australian stablecoin. It was part of Phase 2 of the e-HKD+ Pilot Program, initiated by the Hong Kong Monetary Authority.\n\nChainlink’s Cross-Chain Interoperability Protocol <a href=\"https://x.com/chainlink/status/1932045935221121394\">enabled</a> seamless transactions. It ",
  "published": "Mon, 09 Jun 2025 15:42:39 +0000",
  "content": "<strong>Chainlink (LINK) played a pivotal role in a successful pilot program that facilitated the exchange of two central bank digital currencies (CBDCs).</strong>\n\nThe pilot involved the Hong Kong digital dollar (e-HKD) and an Australian stablecoin. It was part of Phase 2 of the e-HKD+ Pilot Program, initiated by the Hong Kong Monetary Authority.\n\nChainlink’s Cross-Chain Interoperability Protocol <a href=\"https://x.com/chainlink/status/1932045935221121394\">enabled</a> seamless transactions. It showcases how smart contract technology can bridge traditional finance and the decentralized finance ecosystem.\n\n<img alt=\"Image\" src=\"https://pbs.twimg.com/media/GtABWp0WQAAuEWu?format=jpg&amp;name=large\" />\nChainlink’s Role in Cross-Border Payments\nAt the heart of this milestone was Chainlink’s Cross-Chain Interoperability Protocol, which allowed the exchange between the two digital assets. The transaction used the Australian Stablecoin issued by the Australia and New Zealand Banking Group alongside the e-HKD. \n\nThis integration was key in demonstrating how blockchain-based infrastructure can enhance the efficiency and security of international payments. <a href=\"https://thecryptobasic.com/2025/05/26/xrp-ledger-vs-chainlink-messari-report-highlights-which-is-driving-greater-institutional-adoption/\" rel=\"noopener\" target=\"_blank\">Chainlink’s</a> protocol effectively bridged the gap between different blockchain networks, providing a seamless experience for all parties involved.\nInvolvement of Financial Giants\nThe pilot's success was further strengthened by the involvement of major financial institutions. Visa, Fidelity International, ANZ, and China Asset Management Company participated in the transaction framework. \n\nEach of these players contributed to the pilot's execution and success, reinforcing the growing collaboration between traditional finance and decentralized technologies. This partnership highlights how established financial players are beginning to adopt and integrate blockchain and digital currency solutions into their existing systems.\nExpansion of Blockchain Use in Traditional Finance\nThis pilot also comes when traditional financial institutions show increasing interest in blockchain and Web3 technologies. Recently, JP Morgan <a href=\"https://thecryptobasic.com/2025/05/14/jpmorgan-completes-first-public-tokenized-treasury-transaction-with-chainlink-and-ondo/\">concluded</a> its first transaction on a public chain, signaling a deeper commitment to the Web3 space. \n\nUsing Chainlink’s technology to connect private and public networks, JP Morgan’s transaction with tokenized U.S. Treasuries on Ondo Finance demonstrates how blockchain is reshaping traditional finance.",
  "title_pt": "Chainlink viabiliza projeto piloto transfronteiriço de CBDC-Stablecoin entre Hong Kong e Austrália",
  "summary_pt": "O Chainlink (LINK) desempenhou um papel crucial em um programa piloto bem-sucedido que facilitou a troca de duas moedas digitais de bancos centrais (CBDCs).\n\nO piloto envolveu o dólar digital de Hong Kong (e-HKD) e uma stablecoin australiana.  Fazia parte da Fase 2 do Programa Piloto e-HKD+, iniciado pela Autoridade Monetária de Hong Kong.\n\nO Protocolo de Interoperabilidade Cross-Chain do Chainlink <a href=\"https://x.com/chainlink/status/1932045935221121394\">permitiu</a> transações sem problemas.",
  "content_pt": "Chainlink (LINK) desempenhou um papel crucial em um programa piloto bem-sucedido que facilitou a troca de duas moedas digitais de bancos centrais (CBDCs).\n\nO piloto envolveu o dólar digital de Hong Kong (e-HKD) e uma stablecoin australiana.  Fazia parte da Fase 2 do Programa Piloto e-HKD+, iniciado pela Autoridade Monetária de Hong Kong.\n\nO Protocolo de Interoperabilidade Cross-Chain do Chainlink [link para o tweet] possibilitou transações sem interrupções.  Isso demonstra como a tecnologia de contratos inteligentes pode conectar as finanças tradicionais ao ecossistema de finanças descentralizadas (DeFi).\n\n[imagem]\n\n**O Papel do Chainlink em Pagamentos Transfronteiriços**\n\nO cerne deste marco foi o Protocolo de Interoperabilidade Cross-Chain do Chainlink, que permitiu a troca entre os dois ativos digitais. A transação utilizou a stablecoin australiana emitida pelo Australia and New Zealand Banking Group (ANZ) juntamente com o e-HKD.\n\nEssa integração foi fundamental para demonstrar como a infraestrutura baseada em blockchain pode melhorar a eficiência e a segurança de pagamentos internacionais. O protocolo do Chainlink [link para o artigo] efetivamente preencheu a lacuna entre diferentes redes blockchain, proporcionando uma experiência perfeita para todas as partes envolvidas.\n\n**Envolvimento de Gigantes Financeiros**\n\nO sucesso do piloto foi ainda mais fortalecido pela participação de grandes instituições financeiras. Visa, Fidelity International, ANZ e China Asset Management Company participaram da estrutura da transação.\n\nCada um desses players contribuiu para a execução e o sucesso do piloto, reforçando a crescente colaboração entre as finanças tradicionais e as tecnologias descentralizadas. Essa parceria destaca como players financeiros estabelecidos estão começando a adotar e integrar soluções blockchain e de moedas digitais em seus sistemas existentes.\n\n**Expansão do Uso de Blockchain nas Finanças Tradicionais**\n\nEste piloto também ocorre em um momento em que instituições financeiras tradicionais demonstram interesse crescente em tecnologias blockchain e Web3. Recentemente, o JP Morgan [link para o artigo] concluiu sua primeira transação em uma cadeia pública, sinalizando um compromisso mais profundo com o espaço Web3.\n\nUsando a tecnologia do Chainlink para conectar redes privadas e públicas, a transação do JP Morgan com títulos do Tesouro dos EUA tokenizados na Ondo Finance demonstra como a blockchain está remodelando as finanças tradicionais.",
  "filename": "post_1749510028_chainlink-viabiliza-projeto-piloto-transfronteirico-de-cbdc-stablecoin-entre-hon.json"
}