{
  "id": "https://thecryptobasic.com/?p=127921",
  "title": "Strategy Buys Additional 1,045 Bitcoin for $110M, Nears 600K BTC Holdings",
  "link": "https://thecryptobasic.com/2025/06/09/strategy-buys-additional-1045-bitcoin-for-110m-nears-600k-btc-holdings/?utm_source=rss&utm_medium=rss&utm_campaign=strategy-buys-additional-1045-bitcoin-for-110m-nears-600k-btc-holdings",
  "summary": "<b>The Michael Saylor-led Bitcoin company, Strategy, has announced a fresh acquisition of Bitcoin, bringing its holdings closer to 600,000 BTC.</b>\n\nIn today’s <a href=\"https://x.com/saylor/status/1932045860851859842\" rel=\"nofollow noopener\" target=\"_blank\">announcement</a>, Saylor disclosed that the company has added 1,045 BTC to its balance sheet. The acquisition cost approximately $110.2 million, translating to an average price of $105,426 per coin. With Bitcoin trading above $107K at press t",
  "published": "Mon, 09 Jun 2025 15:37:33 +0000",
  "content": "<b>The Michael Saylor-led Bitcoin company, Strategy, has announced a fresh acquisition of Bitcoin, bringing its holdings closer to 600,000 BTC.</b>\n\nIn today’s <a href=\"https://x.com/saylor/status/1932045860851859842\" rel=\"nofollow noopener\" target=\"_blank\">announcement</a>, Saylor disclosed that the company has added 1,045 BTC to its balance sheet. The acquisition cost approximately $110.2 million, translating to an average price of $105,426 per coin. With Bitcoin trading above $107K at press time, this latest purchase is currently in a profitable position.\n\nThis addition has raised Strategy’s Bitcoin portfolio to 582,000 BTC, acquired with a total investment of $40.8 billion. \n\nNotably, Strategy (formerly MicroStrategy) has been buying Bitcoin since September 2020. Based on its total investment relative to its holdings, the company’s average cost per Bitcoin now stands at $70,086.\n\nWith Bitcoin’s market value at $107,550 as of press time, Strategy is sitting on an unrealized profit of $21.8 billion, or approximately 53%. The company now holds a Bitcoin portfolio worth $62.59 billion, the largest among publicly traded firms.\nHow Strategy Funded Its Recent Bitcoin Purchase\nStrategy funded this latest acquisition through the sale of preferred equity under two active at-the-market (ATM) offerings. The company sold 626,639 STRK shares of its 8.00% Series A perpetual preferred stock, raising capital <a href=\"https://thecryptobasic.com/2025/05/02/strategy-unveils-42-billion-capital-plan-to-expand-bitcoin-holdings/\" rel=\"noopener\" target=\"_blank\">under its $21 billion STRK program</a>, established in March 2025.\n\nAdditionally, Strategy sold 432,679 STRF shares of its 10.00% Series A perpetual preferred stock as part of its $2.1 billion STRF program launched in May 2025.\n\nThis marks Strategy's second Bitcoin purchase this month, continuing the company’s ongoing weekly acquisition plan. On June 2, it announced the purchase of 705 BTC for $75 million at an average price of $106,495.\n\n<figure class=\"wp-caption alignnone\" id=\"attachment_127922\" style=\"width: 1484px;\"><img alt=\"Saylor Bitcoin purchase funded through equity sale\" class=\"wp-image-127922 size-full\" height=\"1114\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/Screenshot-2025-06-09-at-42124%20pm.png\" title=\"Screenshot 2025 06 09 at 42124 pm\" width=\"1484\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-127922\">Saylor Bitcoin purchase funded through equity sale</figcaption></figure>\nConcerns Over Rising Unit Costs\nHowever, with Strategy’s average Bitcoin acquisition cost now around $70,000, critics like Peter Schiff have <a href=\"https://thecryptobasic.com/2024/11/01/peter-schiff-trolls-microstrategys-42b-bitcoin-purchase-plan-calls-michael-saylor-the-egg-man/\" rel=\"noopener\" target=\"_blank\">raised concerns</a> about increasing risk to investors. He argues that continued purchases in the $100K range raise the average cost per Bitcoin, increasing the company's exposure to potential losses if the market dips.\n\nDuring the most recent significant correction, Bitcoin dropped to $74,400, just above Strategy’s average cost of $70,089. If Bitcoin were to fall below that level, the entire holding would be in the red.\n\nSome analysts warn that if major institutional players, especially miners, see their cost basis turn negative, it could trigger a bear market, as these entities might be forced to sell to minimize losses. The prevailing belief is that the market will remain bullish only as long as major holders stay profitable.\n\nKi Young Ju <a href=\"https://thecryptobasic.com/2025/02/19/even-if-bitcoin-dips-by-30-to-77k-bull-run-remains-intact-cryptoquant-ceo-explains-why/\" rel=\"noopener\" target=\"_blank\">expressed</a> a similar sentiment in an earlier analysis, noting at the time that miners' cost basis was around $57K.\n\nMeanwhile, Michael Saylor has reiterated that there are no plans to sell Bitcoin. His consistent acquisitions over the past five years support this stance.",
  "title_pt": "Estratégia compra mais 1.045 Bitcoin por US$ 110 milhões, aproximando-se de 600.000 BTC.",
  "summary_pt": "A empresa de Bitcoin liderada por Michael Saylor, a MicroStrategy, anunciou uma nova aquisição de Bitcoin, aproximando suas reservas de 600.000 BTC.\n\nEm anúncio de hoje, Saylor divulgou que a empresa adicionou 1.045 BTC ao seu balanço patrimonial. O custo da aquisição foi de aproximadamente US$ 110,2 milhões, resultando em um preço médio de US$ 105.426 por moeda. Com o Bitcoin sendo negociado acima de US$ 107.000 no momento da publicação, [link para o anúncio].",
  "content_pt": "A empresa de Bitcoin liderada por Michael Saylor, a Strategy, anunciou uma nova aquisição de Bitcoin, aproximando suas posses de 600.000 BTC.\n\nEm um anúncio de hoje [link para o anúncio], Saylor divulgou que a empresa adicionou 1.045 BTC ao seu balanço patrimonial. O custo da aquisição foi de aproximadamente US$ 110,2 milhões, resultando em um preço médio de US$ 105.426 por moeda. Com o Bitcoin sendo negociado acima de US$ 107.000 no momento da publicação, esta última compra está atualmente em posição lucrativa.\n\nEssa adição elevou o portfólio de Bitcoin da Strategy para 582.000 BTC, adquirido com um investimento total de US$ 40,8 bilhões.\n\nÉ importante destacar que a Strategy (anteriormente MicroStrategy) vem comprando Bitcoin desde setembro de 2020. Com base em seu investimento total em relação a suas posses, o custo médio por Bitcoin da empresa agora é de US$ 70.086.\n\nCom o valor de mercado do Bitcoin em US$ 107.550 no momento da publicação, a Strategy está registrando um lucro não realizado de US$ 21,8 bilhões, ou aproximadamente 53%. A empresa detém agora um portfólio de Bitcoin no valor de US$ 62,59 bilhões, o maior entre as empresas de capital aberto.\n\n**Como a Strategy Financiou sua Recente Compra de Bitcoin**\n\nA Strategy financiou essa última aquisição por meio da venda de ações preferenciais em duas ofertas ativas no mercado (ATM). A empresa vendeu 626.639 ações STRK de sua ação preferencial perpétua Série A de 8,00%, levantando capital [link para o artigo sobre o programa STRK] sob seu programa STRK de US$ 21 bilhões, estabelecido em março de 2025.\n\nAdicionalmente, a Strategy vendeu 432.679 ações STRF de sua ação preferencial perpétua Série A de 10,00% como parte de seu programa STRF de US$ 2,1 bilhões lançado em maio de 2025.\n\nEsta é a segunda compra de Bitcoin da Strategy neste mês, dando continuidade ao plano de aquisição semanal da empresa. Em 2 de junho, anunciou a compra de 705 BTC por US$ 75 milhões a um preço médio de US$ 106.495.\n\n[Imagem: Saylor Bitcoin purchase funded through equity sale]\n\n**Preocupações com o Aumento dos Custos Unitários**\n\nNo entanto, com o custo médio de aquisição de Bitcoin da Strategy agora em torno de US$ 70.000, críticos como Peter Schiff [link para o artigo sobre Peter Schiff] levantaram preocupações sobre o aumento do risco para os investidores. Ele argumenta que compras contínuas na faixa de US$ 100.000 aumentam o custo médio por Bitcoin, aumentando a exposição da empresa a potenciais perdas se o mercado cair.\n\nDurante a correção significativa mais recente, o Bitcoin caiu para US$ 74.400, pouco acima do custo médio da Strategy de US$ 70.089. Se o Bitcoin cair abaixo desse nível, toda a posse ficará no vermelho.\n\nAlguns analistas advertem que, se os principais players institucionais, especialmente os mineradores, virem sua base de custo negativa, isso pode desencadear um mercado em baixa, pois essas entidades podem ser forçadas a vender para minimizar as perdas. A crença predominante é que o mercado permanecerá otimista apenas enquanto os principais detentores permanecerem lucrativos.\n\nKi Young Ju [link para o artigo de Ki Young Ju] expressou um sentimento semelhante em uma análise anterior, observando na época que a base de custo dos mineradores estava em torno de US$ 57.000.\n\nEnquanto isso, Michael Saylor reiterou que não há planos para vender Bitcoin. Suas aquisições consistentes nos últimos cinco anos corroboram essa posição.",
  "filename": "post_1749510041_estrategia-compra-mais-1045-bitcoin-por-us-110-milhoes-aproximando-se-de-600000-.json"
}