{
  "id": "https://thecryptobasic.com/?p=127913",
  "title": "Crypto Investment Products See $224M Inflows Led by Ethereum Amid Bitcoin Outflows",
  "link": "https://thecryptobasic.com/2025/06/09/crypto-investment-products-see-224m-inflows-led-by-ethereum-amid-bitcoin-outflows/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-investment-products-see-224m-inflows-led-by-ethereum-amid-bitcoin-outflows",
  "summary": "<b>Digital asset investment products continue strong inflows, with Ethereum leading, while Bitcoin and other altcoins see moderate outflows.</b>\n\n<a href=\"https://blog.coinshares.com/volume-237-digital-asset-fund-flows-weekly-report-be52f926615f\" rel=\"nofollow noopener\" target=\"_blank\">According</a> to data from CoinShares, last week, digital asset investment products saw $224 million in inflows, extending a seven-week streak of positive growth. \n\nThis brings the total inflows over the past seve",
  "published": "Mon, 09 Jun 2025 15:27:22 +0000",
  "content": "<b>Digital asset investment products continue strong inflows, with Ethereum leading, while Bitcoin and other altcoins see moderate outflows.</b>\n\n<a href=\"https://blog.coinshares.com/volume-237-digital-asset-fund-flows-weekly-report-be52f926615f\" rel=\"nofollow noopener\" target=\"_blank\">According</a> to data from CoinShares, last week, digital asset investment products saw $224 million in inflows, extending a seven-week streak of positive growth. \n\nThis brings the total inflows over the past seven weeks to $11 billion. However, the pace of inflows has started to decelerate, reflecting growing uncertainty over U.S. monetary policy. \n\nInvestors appear to be adopting a cautious, wait-and-see approach, particularly as the U.S. Federal Reserve’s signals on inflation remain unclear.\nEthereum's Dominance and Bitcoin's Decline\nInterestingly, Ethereum continued its impressive performance, leading the pack with $296.4 million in inflows. This marks the seventh straight week of inflows for Ethereum, bringing the total within this period to $1.5 billion, or 10.5% of total AUM. \n\n<figure class=\"wp-caption alignnone\" id=\"attachment_127927\" style=\"width: 846px;\"><figure><img alt=\"Ethereum Leads Digital Assets Inflows\" class=\"size-full wp-image-127927\" height=\"642\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/Ethereum-Leads-Digital-Assets-Inflows.png\" title=\"Ethereum Leads Digital Assets Inflows\" width=\"846\" /><figcaption>Ethereum Leads Digital Assets Inflows</figcaption></figure><figcaption class=\"wp-caption-text\" id=\"caption-attachment-127927\">Ethereum Leads Digital Assets Inflows | CoinShares</figcaption></figure>\n\nThe surge in Ethereum's inflows represents the strongest inflows since last November’s U.S. election. In contrast, <a href=\"https://thecryptobasic.com/2025/06/09/bitcoin-v-shaped-recovery-at-risk-will-btc-dip-to-102k-or-pump-to-112k/\" rel=\"noopener\" target=\"_blank\">Bitcoin</a> faced a second straight week of modest outflows, amounting to $56.5 million. This decline in Bitcoin investment products, combined with outflows from short-bitcoin products, shows a shift in sentiment amid ongoing policy uncertainty.\nAltcoins and Multi-Asset Products\nAlso, the altcoin market has remained relatively subdued, with minor inflows observed in Sui, which attracted $1.1 million. On the other hand, XRP experienced its third consecutive week of outflows, totaling $6.6 million. \n\nInterestingly, XRP has maintained stronger year-to-date flows, which total $194 million, indicating consistent investor interest despite recent outflows. Meanwhile, multi-asset products saw $6.6 million in outflows for the week, with a year-to-date decline of $142 million. This suggests that investors are increasingly favoring single-asset investments, particularly in Bitcoin and Ethereum, over diversified portfolios.\n\nDespite these market fluctuations, <a href=\"https://thecryptobasic.com/2025/06/04/moscow-exchange-launches-bitcoin-futures-tied-to-blackrock-etf/\" rel=\"noopener\" target=\"_blank\">iShares ETFs</a> experienced the highest inflows of any provider, with $330 million entering their products last week. This consistent growth in iShares’ inflows contrasts with the outflows seen from other providers like Grayscale Investments and Fidelity Wise Origin Bitcoin, which saw reductions of $16 million and $168 million, respectively.\nRegional Breakdown of Investment Flows\nThe regional breakdown of inflows showed that the U.S. led the pack with $175 million, followed by Germany at $47.8 million. Switzerland, Canada, and Australia also saw significant investments, with $15.7 million, $9.8 million, and $6.5 million, in inflows respectively. \n\nHowever, the trend wasn’t universally positive. Brazil saw outflows of $9.2 million, and Hong Kong experienced outflows of $14.6 million, signaling a slowdown in their previously strong inflow activity. Notably, Hong Kong’s outflows mark the end of record-breaking inflows in the region.",
  "title_pt": "Entrada de US$ 224 milhões em produtos cripto, liderada por Ethereum, enquanto Bitcoin registra saída de capital.",
  "summary_pt": "Produtos de investimento em ativos digitais continuam recebendo fortes entradas de capital, com o Ethereum liderando, enquanto Bitcoin e outras altcoins apresentam saídas moderadas.\n\nDe acordo com dados da CoinShares, na semana passada, produtos de investimento em ativos digitais registraram entradas de US$ 224 milhões, estendendo uma sequência de sete semanas de crescimento positivo.  Isso eleva o total de entradas nos últimos sete... (a frase foi cortada no texto original).",
  "content_pt": "Produtos de investimento em ativos digitais continuam recebendo fortes entradas de capital, com o Ethereum liderando, enquanto Bitcoin e outras altcoins registram saídas moderadas.\n\nDe acordo com dados da CoinShares, na semana passada, produtos de investimento em ativos digitais receberam US$ 224 milhões em entradas, estendendo uma sequência de sete semanas de crescimento positivo.\n\nIsso eleva o total de entradas nos últimos sete semanas a US$ 11 bilhões. No entanto, o ritmo das entradas começou a desacelerar, refletindo a crescente incerteza sobre a política monetária dos EUA.\n\nOs investidores parecem estar adotando uma abordagem cautelosa de \"esperar e ver\", principalmente porque os sinais do Federal Reserve dos EUA sobre a inflação permanecem incertos.\n\n**Domínio do Ethereum e queda do Bitcoin**\n\nCuriosamente, o Ethereum continuou seu desempenho impressionante, liderando o grupo com US$ 296,4 milhões em entradas. Esta é a sétima semana consecutiva de entradas para o Ethereum, totalizando US$ 1,5 bilhão neste período, ou 10,5% do AUM total.\n\n<figure class=\"wp-caption alignnone\" id=\"attachment_127927\" style=\"width: 846px;\"><figure><img alt=\"Ethereum Leads Digital Assets Inflows\" class=\"size-full wp-image-127927\" height=\"642\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/Ethereum-Leads-Digital-Assets-Inflows.png\" title=\"Ethereum Leads Digital Assets Inflows\" width=\"846\" /><figcaption>Ethereum Leads Digital Assets Inflows</figcaption></figure><figcaption class=\"wp-caption-text\" id=\"caption-attachment-127927\">Ethereum Leads Digital Assets Inflows | CoinShares</figcaption></figure>\n\nO aumento nas entradas do Ethereum representa as entradas mais fortes desde a eleição americana de novembro passado. Em contraste, o Bitcoin enfrentou uma segunda semana consecutiva de baixas saídas, totalizando US$ 56,5 milhões. Essa queda nos produtos de investimento em Bitcoin, combinada com as saídas de produtos short-Bitcoin, mostra uma mudança de sentimento em meio à incerteza política contínua.\n\n**Altcoins e produtos multi-ativos**\n\nAlém disso, o mercado de altcoins permaneceu relativamente contido, com entradas mínimas observadas em Sui, que atraiu US$ 1,1 milhão. Por outro lado, o XRP experimentou sua terceira semana consecutiva de saídas, totalizando US$ 6,6 milhões.\n\nCuriosamente, o XRP manteve fluxos mais fortes no ano até o momento, totalizando US$ 194 milhões, indicando interesse consistente dos investidores, apesar das saídas recentes. Enquanto isso, os produtos multi-ativos registraram US$ 6,6 milhões em saídas na semana, com uma queda de US$ 142 milhões no ano até o momento. Isso sugere que os investidores estão cada vez mais favorecendo investimentos em ativos únicos, particularmente em Bitcoin e Ethereum, em detrimento de carteiras diversificadas.\n\nApesar dessas flutuações de mercado, os iShares ETFs experimentaram as maiores entradas de qualquer provedor, com US$ 330 milhões entrando em seus produtos na semana passada. Esse crescimento consistente nas entradas da iShares contrasta com as saídas observadas de outros provedores, como Grayscale Investments e Fidelity Wise Origin Bitcoin, que registraram reduções de US$ 16 milhões e US$ 168 milhões, respectivamente.\n\n**Distribuição regional dos fluxos de investimento**\n\nA distribuição regional das entradas mostrou que os EUA lideraram com US$ 175 milhões, seguidos pela Alemanha com US$ 47,8 milhões. Suíça, Canadá e Austrália também viram investimentos significativos, com US$ 15,7 milhões, US$ 9,8 milhões e US$ 6,5 milhões em entradas, respectivamente.\n\nNo entanto, a tendência não foi universalmente positiva. O Brasil registrou saídas de US$ 9,2 milhões, e Hong Kong experimentou saídas de US$ 14,6 milhões, sinalizando uma desaceleração em sua atividade de entrada anteriormente forte. Notavelmente, as saídas de Hong Kong marcam o fim de entradas recordes na região.",
  "filename": "post_1749510056_entrada-de-us-224-milhoes-em-produtos-cripto-liderada-por-ethereum-enquanto-bitc.json"
}