{
  "id": "https://thecryptobasic.com/?p=127917",
  "title": "Ripple Ally SBI Holdings Invests $50M in Circle IPO",
  "link": "https://thecryptobasic.com/2025/06/09/ripple-ally-sbi-holdings-invests-50m-in-circle-ipo/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-ally-sbi-holdings-invests-50m-in-circle-ipo",
  "summary": "<strong>Ripple partner SBI Holdings and its affiliate SBI Shinsei Bank announced a multi-million-dollar investment in Circle, the issuer of USDC, following Circle's IPO. </strong>\nSBI Holdings Now Betting on Circle\nThe investment, worth $50 million, was split equally, with both SBI Holdings and SBI Shinsei Bank contributing $25 million. This move follows the launch of Circle SBI Japan KK, a joint venture formed in March 2025 to push the adoption and circulation of USDC in the Japanese market.\n\nT",
  "published": "Mon, 09 Jun 2025 15:11:33 +0000",
  "content": "<strong>Ripple partner SBI Holdings and its affiliate SBI Shinsei Bank announced a multi-million-dollar investment in Circle, the issuer of USDC, following Circle's IPO. </strong>\nSBI Holdings Now Betting on Circle\nThe investment, worth $50 million, was split equally, with both SBI Holdings and SBI Shinsei Bank contributing $25 million. This move follows the launch of Circle SBI Japan KK, a joint venture formed in March 2025 to push the adoption and circulation of USDC in the Japanese market.\n\nThe recent <a class=\"editor-rtfLink\" href=\"https://www.sbigroup.co.jp/english/news/pdf/2025/0609_a_en.pdf\" rel=\"nofollow noopener\" target=\"_blank\">announcement</a>, revealed in a press release today, shows the growing alliance between SBI Group and Circle, which began with a <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2023/11/27/ripple-and-xrp-believer-sbi-holdings-joins-hands-with-circle-to-promote-usdc-in-japan/\" rel=\"noopener\" target=\"_blank\">business agreement</a> signed in November 2023. \n\n<figure class=\"wp-caption alignnone\" id=\"attachment_127918\" style=\"width: 930px;\"><figure><img alt=\"Ripple Ally SBI Holdings Announces Circle Investment\" class=\"size-full wp-image-127918\" height=\"715\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/Ripple-Ally-SBI-Holdings-Announces-Circle-Investment.png\" title=\"Ripple Ally SBI Holdings Announces Circle Investment\" width=\"930\" /><figcaption>Ripple Ally SBI Holdings Announces Circle Investment</figcaption></figure><figcaption class=\"wp-caption-text\" id=\"caption-attachment-127918\">Ripple Ally SBI Holdings Announces Circle Investment</figcaption></figure>\n\nThe relationship has since moved into collaborative efforts across various areas of digital finance, with SBI VC Trade, the crypto exchange subsidiary of SBI Group, becoming the first platform in Japan to offer USDC earlier this year publicly.\nCircle's Successful IPO\nNotably, the backing from <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/tag/sbi/\" rel=\"noopener\" target=\"_blank\">SBI Group</a> comes on the heels of Circle's successful market debut. Circle's IPO officially launched on June 5, under the ticker symbol \"CRCL\". \n\nOriginally aiming to raise up to $6.71 billion at a price range of $24 to $26 per share, the offering was later upsized to 34 million shares at $31 each, exceeding revised expectations of $27 to $28. \n\nInterestingly, on its first day of trading, shares opened at $69 and closed at $83.23, pushing the company's market cap to around $16.7 billion. The IPO, which raised between $1.05 billion and $1.1 billion, was one of the most successful fintech public offerings since Coinbase's 2021 debut.\n\nNotably, SBI Holdings' move to acquire a significant stake in Circle coincides with strong investor demand, as the IPO was reportedly 25 times oversubscribed, according to a <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/06/04/circle-ipo-found-to-be-oversubscribed-by-25x-heres-what-this-means-and-how-it-could-affect-ripples-bid/\" rel=\"noopener\" target=\"_blank\">previous report</a> from <em>The Crypto Basic.</em>\nSBI's Relationship with Ripple and Talks of Circle Acquisition \nThe investment also indicates a growth in SBI's crypto strategy. Historically, SBI has been one of Ripple's most significant backers, with the Japanese conglomerate currently holding approximately 9% of Ripple's shares. \n\nSince 2016, SBI and Ripple have collaborated through the joint venture SBI Ripple Asia, seeking to drive the adoption of XRP and the XRP Ledger across Asia. SBI has also made major investments in blockchain ventures, including R3 and Securitize.\n\nMeanwhile, reports of Ripple exploring a potential acquisition of Circle have dwindled following Circle's IPO. Ripple reportedly made a $4–5 billion offer, which Circle rejected. Ripple CEO Brad Garlinghouse <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/06/04/ripple-ceo-says-ripple-never-offered-10-20b-to-acquire-circle-report/\" rel=\"noopener\" target=\"_blank\">debunked claims</a> that the firm raised its offer to $20 billion.\n\nNotably, by the time of Circle's IPO, the company had achieved a valuation far exceeding the earlier offers, dampening speculation around a potential acquisition. However, <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/06/06/heres-why-circles-strong-ipo-doesnt-eliminate-a-possible-ripple-deal/\" rel=\"noopener\" target=\"_blank\">some argue</a> that Circle's IPO does not automatically rule out a potential acquisition.",
  "title_pt": "SBI Holdings, aliada da Ripple, investe US$ 50 milhões no IPO da Circle",
  "summary_pt": "A SBI Holdings, parceira da Ripple, e sua afiliada, o SBI Shinsei Bank, anunciaram um investimento multimilionário na Circle, emissora da stablecoin USDC, após o IPO da Circle.\n\n**SBI Holdings aposta na Circle**\n\nO investimento, no valor de US$ 50 milhões, foi dividido igualmente, com SBI Holdings e SBI Shinsei Bank contribuindo com US$ 25 milhões cada.  Essa iniciativa sucede o lançamento da Circle SBI Japan KK, uma joint venture formada em março de 2025 para impulsionar a adoção e circulação do USDC no mercado japonês.",
  "content_pt": "A parceira da Ripple, SBI Holdings, e sua afiliada, SBI Shinsei Bank, anunciaram um investimento multimilionário na Circle, emissora da stablecoin USDC, após o IPO da Circle.\n\n**SBI Holdings aposta na Circle**\n\nO investimento, no valor de US$ 50 milhões, foi dividido igualmente, com SBI Holdings e SBI Shinsei Bank contribuindo com US$ 25 milhões cada. Essa iniciativa sucede o lançamento da Circle SBI Japan KK, uma joint venture formada em março de 2025 para impulsionar a adoção e circulação da USDC no mercado japonês.\n\nO anúncio recente, revelado em um comunicado à imprensa, demonstra a crescente aliança entre o SBI Group e a Circle, iniciada com um acordo comercial assinado em novembro de 2023.\n\nA relação evoluiu para esforços colaborativos em várias áreas de finanças digitais, com a SBI VC Trade, subsidiária de exchange de criptomoedas do SBI Group, tornando-se a primeira plataforma no Japão a oferecer publicamente a USDC no início deste ano.\n\n**IPO de Sucesso da Circle**\n\nNotavelmente, o apoio do SBI Group surge após a estreia bem-sucedida da Circle no mercado. O IPO da Circle foi lançado oficialmente em 5 de junho, sob o símbolo \"CRCL\".\n\nInicialmente buscando arrecadar até US$ 6,71 bilhões com uma faixa de preço de US$ 24 a US$ 26 por ação, a oferta foi posteriormente ampliada para 34 milhões de ações a US$ 31 cada, superando as expectativas revisadas de US$ 27 a US$ 28.\n\nCuriosamente, em seu primeiro dia de negociação, as ações abriram a US$ 69 e fecharam a US$ 83,23, elevando a capitalização de mercado da empresa para cerca de US$ 16,7 bilhões. O IPO, que arrecadou entre US$ 1,05 bilhão e US$ 1,1 bilhão, foi uma das ofertas públicas de fintech de maior sucesso desde a estreia da Coinbase em 2021.\n\nVale destacar que a iniciativa da SBI Holdings de adquirir uma participação significativa na Circle coincide com a forte demanda dos investidores, pois o IPO foi supostamente 25 vezes acima da subscrição, de acordo com um relatório anterior.\n\n**Relacionamento da SBI com a Ripple e Discussões sobre Aquisição da Circle**\n\nO investimento também indica um crescimento na estratégia de criptomoedas da SBI. Historicamente, a SBI tem sido uma das apoiadoras mais significativas da Ripple, com o conglomerado japonês detendo atualmente aproximadamente 9% das ações da Ripple.\n\nDesde 2016, a SBI e a Ripple colaboram por meio da joint venture SBI Ripple Asia, buscando impulsionar a adoção do XRP e do XRP Ledger na Ásia. A SBI também fez grandes investimentos em empreendimentos de blockchain, incluindo R3 e Securitize.\n\nEnquanto isso, os relatos de que a Ripple estaria explorando uma possível aquisição da Circle diminuíram após o IPO da Circle. A Ripple teria feito uma oferta de US$ 4 a 5 bilhões, que a Circle rejeitou. O CEO da Ripple, Brad Garlinghouse, refutou alegações de que a empresa aumentou sua oferta para US$ 20 bilhões.\n\nNotavelmente, na época do IPO da Circle, a empresa havia atingido uma avaliação muito superior às ofertas anteriores, diminuindo as especulações sobre uma possível aquisição. No entanto, alguns argumentam que o IPO da Circle não elimina automaticamente a possibilidade de uma aquisição.",
  "filename": "post_1749510071_sbi-holdings-aliada-da-ripple-investe-us-50-milhoes-no-ipo-da-circle.json"
}